baseCase_openspace/system/blockMeshDict.new
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
 (0 0 0)        	//Point 0
 (0.0013 0.05 0)     	//Point 1
 (-0.0013 0.05 0) // Point 2
 (0 0 0.05) 		//Point 3
 (0.0013 0.03535534 0.03535534) // Point 4 Intermediate point for 3 1 (0) arc
 // Other side. Angle of 3 degrees
 (-0.0013 0.03535534 0.03535534) // Point 5: Intermediate point for arc for other side
 );
 
blocks
(

 // Block 1
 // See: https://cfd.direct/openfoam/user-guide/v8-mesh-description/#x24-1680005.1
 // Create tet with hex
 hex (3 2 1 3 0 0 0 0) (100 1 100) simpleGrading (1 1 0.1)
 // (points) (geometry) (grading)
 // (...) (num_of_radial depth volume) (how close to edge 0 3, , )
);

edges
(
 arc 3 1 origin (0 0 0)
 arc 3 2 origin (0 0 0)
);

boundary
(

 symmetric
 {
   type symmetry;
   faces
     (
      (0 1 2 0)
      );
 }

 environment
 {
   type patch;
   faces
     (
      (3 2 1 3)
      );
 }
 
 wedgePatch1
 {
   type wedge; 
   faces
     (
      (0 1 3 0)
 	
      );
 }
	
 wedgePatch2
 {
   type wedge; 
   faces
     (
      (0 2 3 0)
 	
      );
 }

 axis
 {
   type empty;
   faces
     (
      (0 3 3 0)
      );
 }

);
