baseCase_openspace/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mul             [1 -1 -1 0 0] 0.0065;

muv             [1 -1 -1 0 0] 5.953e-06;

phases (vapour water);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 9.131485434e-07; // V = 0.0009106819194523486 [Pa s] / 997.2987703166269 [kg/m3]
    rho             [1 -3 0 0 0 0 0] 997.2987703166269;
}

vapour
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 0.0006625147018764871; // V = 9.671916259038312e-06 [Pa s]
    rho             [1 -3 0 0 0 0 0] 0.014598794912239475;
}

// ************************************************************************* //
